---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookStyle
source: html/e3bf2a6e-8941-1744-c39f-3acf5b8d70c5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookStyle Property

"Style"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeHookStyle { get; }
```